Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་རྟག་པར་རབ་ཏུ་ངུ་བའི་ལེའུ་སྟེ། བདུན་ཅུ་རྩ་བཞི་པའོ།། །།དེ་སྐད་སྨྲས་པ་དང་།
en: This completes the seventy-fourth chapter, “Sadāprarudita,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་གང་ནས་ཀྱང་མ་བྱོན།
en: ”{Va.253} Chapter 75: Dharmodgata “The bodhisattva great being Dharmodgata then replied to the bodhisattva great being Sadāprarudita, ‘Noble son, tathāgatas do not come from anywhere, nor do they go anywhere.

source: གང་དུ་ཡང་མི་བཞུད་དེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་མི་གཡོ་བའོ།
en: The tathāgatas do not move.

source: །དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ། དེ་བཞིན་གཤེགས་པའོ།
en: The real nature is the tathāgatas.

source: །རིགས་ཀྱི་བུ་སྐྱེ་བ་མེད་པ་དེ་ནི་འགྲོ་བ་འམ་འོང་བ་མེད་དེ།
en: Noble son, nonarising neither goes nor comes.

source: སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That nonarising is the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཡང་དག་པའི་མཐའ་ལ་ནི་འོང་བ་འམ་འགྲོ་བ་མེད་དེ།
en: Noble son, the very limit of reality neither goes not comes.

source: ཡང་དག་པའི་མཐའ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That very limit of reality is the tathāgatas.

source: །རིགས་ཀྱི་བུ་སྟོང་པ་ཉིད་ལ་ནི་འགྲོ་བ་འམ་འོང་བ་མེད་དེ།
en: Noble son, in emptiness there is neither going nor coming.

source: སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That emptiness is the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཇི་ལྟ་བ་ཉིད་ལ་ནི་འོང་བ་འམ་འགྲོ་བ་མེད་དེ།
en: Noble son, the definitive nature neither comes nor goes.

source: ཇི་ལྟ་བ་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That definitive nature is the tathāgatas.

source: །རིགས་ཀྱི་བུ་འདོད་ཆགས་དང་བྲལ་བ་ལ་ནི་འོང་བ་འམ་འགྲོ་བ་མེད་དེ།
en: Noble son, freedom from desire neither comes nor goes.

source: འདོད་ཆགས་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That freedom from desire is the tathāgatas.

source: །རིགས་ཀྱི་བུ་འགོག་པ་ལ་ནི་འོང་བ་འམ་འགྲོ་བ་མེད་དེ།
en: Noble son, cessation neither comes nor goes.

source: འགོག་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའོ།
en: That cessation is the tathāgatas.

source: །རིགས་ཀྱི་བུ་ནམ་མཁའི་དབྱིངས་ལ་ནི་འོང་བ་འམ་འགྲོ་བ་མེད་དེ།
en: Noble son, the expanse of space neither comes nor goes.

source: ནམ་མཁའི་དབྱིངས་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་འོ།
en: That expanse of space is the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཆོས་འདི་རྣམས་ལས་གཞན་པ་ཡང་དེ་བཞིན་གཤེགས་པ་མ་ཡིན་ནོ།
en: Noble son, phenomena other than these attributes are not the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཆོས་འདི་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་ཉིད་གཅིག་སྟེ།
en: Noble son, the real nature of these attributes and the real nature of the tathāgatas is a single real nature.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་ལ་ནི་རྣམ་པ་གཉིས་སུ་མེད་དོ།
en: Noble son, in the real nature there are no dual aspects.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་ནི་གཅིག་སྟེ། གཉིས་མ་ཡིན་གསུམ་མ་ཡིན་ཏེ།
en: Noble son, the real nature is one—it is not two, and it is not three.

source: རིགས་ཀྱི་བུ་འདི་ལྟར་དེ་བཞིན་ཉིད་ནི་མེད་པའི་ཕྱིར་བགྲང་བ་ལས་འདས་པའོ།
en: Noble son, because the real nature is nonexistent, it cannot be counted.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། མི་ཞིག་དཔྱིད་ཟླ་ཐ་ཆུངས་ཀྱི་ཉི་མའི་གུང་ལ་དཔྱིད་ཀྱི་ཉི་མ་ཚ་བས་གདུངས་པ་ན། སྨིག་རྒྱུ་གཡོ་བ་མཐོང་བ་དང་། དེ་དེ་དང་དེ་དག་ཏུ་རྒྱུག་ཅིང་འདིར་ཁྲུས་བྱའོ།
en: Noble son, just as when someone tormented by the heat of spring, during the last month of spring, at noon might see a mirage in motion, and might run toward it, thinking, ‘Here I shall bathe.

source: །འདིར་ཆུ་བཏུང་ངོ་སྙམ་དུ་སེམས་ན། རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཆུ་དེ་གང་ནས་འོངས།
en: Here I shall drink,’ do you think, noble son, that that water has come from anywhere?

source: ཤར་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་འམ། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་ཀྱི་རྒྱ་མཚོར་འགྲོ་འམ། གང་དུ་འགྲོ།
en: Does it go anywhere—into the ocean of the east, or the oceans of the south, west, or north?’ “

source: རྟག་པར་རབ་ཏུ་ངུ་བས་སྨྲས་པ། རིགས་ཀྱི་བུ་སྨིག་རྒྱུ་བ་ལ་ཆུ་ཡོད་པ་མ་ཡིན་ན། དེ་ལ་འོང་བ་དང་འགྲོ་བ་ལྟ་ག་ལ་ཡོད།
en: Sadāprarudita replied, ‘Noble son, since there is no water in a mirage, how could it possibly come and go!

source: རིགས་ཀྱི་བུ་དཔྱིད་ཀྱི་ཚ་བས་གདུངས་པའི་མི་དེ་ནི། སྨིག་རྒྱུ་བ་ཆུ་མེད་པ་ལ་ཆུར་འདུ་ཤེས་སྐྱེད་པས་བྱིས་པའི་རིགས།
en: That person tormented by the heat of spring perceives water but there is no water in a mirage.

source: ཤེས་རབ་རྟུལ་པོའི་རིགས་ཏེ།
en: So he is a naïve person, a person of feeble acumen.

source: དེ་ན་ཆུའི་ངོ་བོ་ནི་ཡོད་པ་མ་ཡིན་ནོ།
en: In that mirage, there exists no essential nature of water.’ “ ‘

source: །ཆོས་ཀྱིས་འཕགས་པས་སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ།
en: Noble son, it is so!

source: །དེ་དེ་བཞིན་ནོ།
en: It is so,’ said Dharmodgata. ‘

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་གང་སུ་ཡང་རུང་བ་འགའ་ཞིག་དེ་བཞིན་གཤེགས་པ་ལ་གཟུགས་སམ་སྒྲར་མངོན་པར་ཞེན་ནས། དེ་དག་དེ་བཞིན་གཤེགས་པ་བྱོན་པ་དང་། བཞུད་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་ནི་བྱིས་པའི་རིགས། ཤེས་རབ་རྟུལ་པོའི་རིགས་སོ། །ཞེས་བརྗོད་པར་བྱ་སྟེ།
en: In the same way, noble son, anyone whatsoever who is fixated on [the notion of] the tathāgatas as form or sound, and who imagines that the tathāgatas come and go, is a naïve person, a person of feeble acumen, just like someone who perceives water where there is no water.

source: དཔེར་ན་མི་ཞིག་ཆུ་མེད་པ་ལ། ཆུར་འདུ་ཤེས་སྐྱེད་པ་བཞིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཀྱི་སྐུ་ཡིན་པས། གཟུགས་ཀྱི་སྐུར་མི་བལྟའོ།
en: If you ask why, the tathāgatas should not be regarded as the buddha body of form, because they are the buddha body of reality.

source: །རིགས་ཀྱི་བུ་ཆོས་ཉིད་ལ་ནི་འགྲོ་བ་འམ། འོང་བ་མེད་དེ།
en: Noble son, in reality there is neither coming nor going.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་བྱོན་པ་འམ། བཞུད་པ་མེད་དོ། །རིགས་ཀྱི་བུ་དཔེར་ན། སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པའི་གླང་པོ་ཆེའི་ཚོགས་སམ། རྟའི་ཚོགས་སམ།
en: In the same way, noble son, the tathāgatas also are without coming and going.

source: ཤིང་རྟའི་ཚོགས་སམ། རྐང་ཏང་གི་ཚོགས་ལ། འོང་བ་འམ། འགྲོ་བ་མེད་དེ། རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་བྱོན་པ་འམ། བཞུད་པ་མེད་དོ།
en: Noble son, just as the corps of elephants, corps of cavalry, corps of chariots, or corps of infantry conjured by an illusionist is without coming or going, in the same way, noble son, the tathāgatas also are without coming or going.

source: །རིགས་ཀྱི་བུ་དཔེར་ན་མི་ཞིག་གི་རྨི་ལམ་དུ། དེ་བཞིན་གཤེགས་པ་གཅིག་གམ། གཉིས་སམ། གསུམ་མམ་བཞི་འམ། ལྔ་འམ། བཅུ་འམ། ཉི་ཤུ་འམ། སུམ་ཅུ་འམ། བཞི་བཅུ་འམ། ལྔ་བཅུ་འམ། བརྒྱ་འམ། སྟོང་ངམ། བརྒྱ་ཕྲག་སྟོང་ངམ། དེ་བས་ཀྱང་མང་བ་མཐོང་ནས་སད་པ་དང་།
en: Noble son, just as someone in a dream may see one tathāgata—or two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, or a hundred thousand tathāgatas, or even more than that—but on waking would not see even a single tathāgata, do you think, noble son, that these tathāgatas have come from anywhere, or gone anywhere?’ “ ‘

source: དེ་བཞིན་གཤེགས་པ་གཅིག་ཀྱང་མ་མཐོང་ན། རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་ནས་བྱོན། དེ་བཞིན་གཤེགས་པ་དེ་དག་གར་བཞུད་རྟག་པར་རབ་ཏུ་ངུ་བས་སྨྲས་པ། རིགས་ཀྱི་བུ་རྨི་ལམ་གྱི་ཆོས་ནི་གང་ཡང་ཡོངས་སུ་གྲུབ་པ་མེད་དེ།
en: Noble son, the phenomena of a dream are without any consummate reality whatsoever. {

source: རྨི་ལམ་ནི་བརྫུན་པ་སྟེ་ཡང་དག་པ་མ་ཡིན་པའོ།
en: Va.254} Dreams are false and inauthentic.’

source: །ཆོས་ཀྱིས་འཕགས་པས་སྨྲས་པ།
en: replied Sadāprarudita. “ ‘

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་རྨི་ལམ་དང་འདྲའོ་ཞེས། དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།
en: In the same way, noble son,’ continued Dharmodgata, ‘all phenomena are like a dream—so said the tathāgatas.

source: རིགས་ཀྱི་བུ་གང་སུ་ཡང་རུང་ཆོས་ཐམས་ཅད་ནི་རྨི་ལམ་དང་འདྲའོ་ཞེས། །དེ་བཞིན་གཤེགས་པས་བཤད་པ་ལེགས་པར་མི་ཤེས་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མིང་གི་ཚོགས་སམ། གཟུགས་ཀྱི་ཚོགས་སུ་མངོན་པར་ཞེན་པས། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱོན་པ་དང་། བཞུད་པར་རྟོག་སྟེ།
en: All those whosoever who do not properly know that all phenomena are like a dream, as the tathāgatas have explained, are fixated on [the notion of] the tathāgatas as a cluster of nominal aggregates or a cluster of physical forms, and in consequence they imagine that the tathāgatas come and go.

source: འདི་ལྟར་ཆོས་ཉིད་རབ་ཏུ་མི་ཤེས་པའི་ཕྱིར་རོ།
en: This is because they do not know reality.

source: །རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པ་བྱོན་པ་འམ། བཞུད་པར་འདོད་པ་དེ་དག་ཐམས་ཅད་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་སྟེ།
en: Noble son, all those who hold that the tathāgatas come or go are simple, ordinary people.

source: དེ་དག་ཐམས་ཅད་ནི་འགྲོ་བ་ལྔའི་འཁོར་བར་དོང་། འདོང་། འདོང་བར་འགྱུར་རོ།
en: All of them have roamed, are roaming, and will roam in cyclic existence, with its five classes of living beings.

source: །དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐག་རིང་།
en: All of them are far from the perfection of wisdom.

source: དེ་དག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་ཐག་རིང་ངོ་།
en: All of them are far from the attributes of the buddhas.

source: །རིགས་ཀྱི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུའོ་ཞེས་བཤད་པ་ལེགས་པར་ཤེས་པ་དེ་དག་ནི། ཆོས་གང་ཡང་འོང་བ་འམ་འགྲོ་བར་མི་རྟོག་གོ །
en: Noble son, those who properly know that the tathāgatas have explained all phenomena to resemble a dream do not conceive of anything at all that comes or goes.

source: གང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་འདི་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་ཏོ།
en: Those who know this reality of the tathāgatas approach unsurpassed, complete enlightenment.

source: །དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ།
en: They practice the perfection of wisdom.

source: །དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སློབ་མ་སྟེ།
en: They are the disciples of the tathāgatas.

source: གྲོང་ཁྱེར་གྱི་བསོད་སྙོམས་དོན་ཡོད་པར་ཟའོ། །དེ་དག་ནི་འཇིག་རྟེན་པའི་སྦྱིན་གནས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོའི་རིན་པོ་ཆེ་རྣམས་ནི་ཤར་ཕྱོགས་ནས་ཀྱང་མ་འོངས། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་།
en: They do not deliberately squander alms donated by citizens, and they are worthy recipients of the world’s generosity.

source: མཚམས་རྣམས་དང་། སྟེང་དང་། འོག་དང་། ཕྱོགས་བཅུ་གང་ནས་ཀྱང་མ་འོངས་མོད་ཀྱི། འོན་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བའི་རྒྱུས་རྒྱ་མཚོ་ཆེན་པོར་རིན་པོ་ཆེ་རྣམས་འབྱུང་སྟེ།
en: Noble son, the gems of the oceans have not come from the east, and they have not come from any other of the ten directions—the south, the west, the north, the intermediate directions, the zenith, or the nadir—but gemstones appear in the oceans through the causal basis of beings’ roots of virtuous actions.

source: དེ་དག་རྒྱུ་མེད་པ་ལས་བྱུང་བ་ཡང་མ་ཡིན་གྱི། རྒྱུ་དང་རྐྱེན་རྣམས་ལ་རག་ལུས་པ། རྟེན་ཅིང་འབྲེལ་པ་ལས་འབྱུང་ངོ་།
en: They have not appeared without a cause, but contingent on causes and conditions, they appear through dependent origination. “ ‘

source: །རིན་པོ་ཆེ་དེ་དག་མེད་པར་འགྱུར་བ་ན་ཡང་ཕྱོགས་བཅུ་གང་དུ་ཡང་མི་འཕོ་སྟེ་དོང་བ་མེད་མོད་ཀྱི། འོན་ཀྱང་རྐྱེན་གང་རྣམས་ཡོད་པ་ལས།
en: Even when these gemstones cease to exist, they do not transmigrate in any of the ten directions.

source: རིན་པོ་ཆེ་དེ་དག་འབྱུང་བར་འགྱུར་བའི་རྐྱེན་རྣམས་མེད་པར་གྱུར་པ་ལས་རིན་པོ་ཆེ་དེ་རྣམས་མེད་པར་འགྱུར་རོ།
en: They do not go anywhere, but nevertheless gemstones do appear when those conditions exist, and they disappear when those conditions are absent.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ཡོངས་སུ་རྫོགས་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གང་ནས་ཀྱང་མ་བྱོན། གང་དུ་ཡང་མི་བཞུད་དོ།
en: In the same way, noble son, the perfect bodies of the tathāgatas have not come from any worlds of the ten directions, nor will they go anywhere.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་དེ་དག་རྒྱུ་མེད་པ་ལས་བྱུང་བ་ཡང་མ་ཡིན་གྱི་སྔོན་གྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུ་དང་རྐྱེན་ཚོགས་པ་ལ་རག་ལུས་པ་རྒྱུ་ལས་ཀུན་དུ་བྱུང་བ་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་སེམས་ཅན་གྱི་དམིགས་པ་དང་ལྡན་པ་ལས་སྣང་སྟེ།
en: Nor did these bodies of the lord buddhas appear without a causal basis, but they appeared contingent on the causes and conditions of their perfect past conduct and within the apprehending of beings whose ripening of past deeds originated from causes.

source: ཕྱོགས་བཅུ་གང་ན་ཡང་ཡོད་པ་ནི་མ་ཡིན་གྱི་རྒྱུ་དང་རྐྱེན་གང་རྣམས་ཡོད་པ་ལས་སྐུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་རྒྱུ་དང་རྐྱེན་དེ་རྣམས་མེད་པ་དང་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ།
en: These bodies do not exist in any of the ten directions, but they are perfectly present when those causes and conditions exist, and they are not perfectly present when those conditions are absent. “ ‘

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། པི་ཝང་གི་སྒྲ་འབྱུང་བའི་ཚེ། གང་ནས་ཀྱང་མ་འོངས། འགག་པའི་ཚེ་གང་དུ་ཡང་མི་འགྲོ་གང་དུ་ཡང་འཕོ་བ་མེད་ལ། རྟེན་ཅིང་ཡང་འབྱུང་བ་རྒྱུ་དང་རྐྱེན་ལ་རག་ལུས་སོ།
en: Noble son, this is just as when the sound of a lute arises—it has not come from anywhere, and when it stops, it does not go anywhere, nor does it transmigrate anywhere, but it is contingent on causes and conditions that are dependently originated.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། པི་ཝང་གི་ཁོག་པ་དང་། པགས་པ་དང་། ཡུ་བ་དང་། རྒྱུད་དང་བླང་བ་དང་སྦྲེང་ཤིང་དང་མིའི་རྩོལ་བ་ལ་རྟེན་ནས་པི་ཝང་གི་སྒྲ་འབྱུང་སྟེ།
en: That is to say, the sound of a stringed instrument emerges dependent on the hollow gourd of the instrument, the skin, the neck, the strings, the supporting cushion, the plectrum, and human exertion.

source: སྒྲ་དེ་ཡང་ཁོག་པ་ལས་ཀྱང་མ་བྱུང་། པགས་པ་དང་། ཡུ་བ་དང་། རྒྱུད་རྣམས་དང་། སྦྲེང་ཤིང་ལས་ཀྱང་མ་བྱུང་།
en: The sound does not emerge from the hollow gourd, nor does it emerge from the skin, the neck, the strings, or the plectrum, nor does it emerge from the supporting cushion or human exertion, but the sound does emerge from all of them together.

source: བླང་བ་དང་། མིའི་རྩོལ་བ་ལས་ཀྱང་མ་བྱུང་མོད་ཀྱི། འོན་ཀྱང་ཐམས་ཅད་འདུས་ཤིང་ལྡན་པ་ལས་སྒྲ་འབྱུང་ངོ་། །འགག་པ་ན་ཡང་སྒྲ་དེ་གང་དུ་ཡང་མི་འགྲོ།
en: When it stops, that sound does not go anywhere.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྐུ་ཡོངས་སུ་རྫོགས་པ་ཡང་། རྒྱུ་དང་རྐྱེན་ལ་རག་ལུས་པ་སྟེ།
en: In the same way, noble son, the perfect body of the tathāgatas is also contingent on causes and conditions.

source: དགེ་བའི་རྩ་བ་དུ་མ་ལས་ཡོངས་སུ་རྫོགས་པའོ།
en: It is perfected through the many roots of their virtuous actions.

source: །རྒྱུ་གཅིག་ལས་མ་བྱུང་།
en: It has not appeared from a single cause.

source: རྐྱེན་གཅིག་ལས་མ་བྱུང་།
en: It has not appeared from a single condition.

source: དགེ་བའི་རྩ་བ་གཅིག་ལས་སངས་རྒྱས་ཀྱི་སྐུ་བྱུང་བ་མ་ཡིན་ནོ།
en: The body of the buddhas has not appeared from a single root of virtue.

source: །རྒྱུ་མེད་པ་ལས་བྱུང་བ་ཡང་མ་ཡིན་ཏེ།
en: It has not appeared without a causal basis.

source: རྒྱུ་དང་རྐྱེན་དུ་མ་ཚོགས་པ་ལས་བྱུང་བ་དེ་གང་ནས་ཀྱང་མ་བྱོན།
en: That is to say, it has appeared from a multiplicity of causes and conditions but does not come from anywhere.

source: རྒྱུ་དང་རྐྱེན་ཚོགས་པ་མེད་ན་ཡང་གང་དུ་ཡང་མི་བཞུད་དོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་བྱོན་པ་དང་།
en: And it does not go anywhere, even when that cluster of causes and conditions is absent.

source: བཞུད་པ་བལྟ་བར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི། ཆོས་ཉིད་ཀྱང་དེ་བཞིན་དུ་རིག་པར་བྱའོ།
en: Noble son, you should know the reality of all phenomena in the same manner.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པར་རབ་ཏུ་ཤེས་ན། ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་རོ།
en: Noble son, if you know that the tathāgatas and all phenomena are nonarising and unceasing, you will be assured of unsurpassed, complete enlightenment.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་ལ་ཡང་ངེས་པར་སྤྱོད་པར་འགྱུར་རོ།
en: You will certainly practice the skill in means associated with the perfection of wisdom.’ “

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་བྱོན་པ་དང་། བཞུད་པ་མེད་པ་སྟོན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། ས་ཆེན་པོ་རབ་ཏུ་གཡོས་པར་གྱུར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་རྣམ་པ་དྲུག་ཏུ་གཡོས། རབ་ཏུ་གཡོས།
en: As he explained this formulation of the Dharma that teaches how the tathāgatas are without coming and going, the great earth shook and all world systems of the great trichiliocosm shook in six ways.

source: ཀུན་དུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ།
en: They shook, shuddered, and juddered.

source: ཀུན་དུ་རབ་ཏུ་འགུལ་ཏོ།
en: They quivered, careened, and convulsed.

source: །བདུད་ཀྱི་གནས་ཐམས་ཅད་ཀྱང་འཁྲུགས། ཉམས་པར་གྱུར་ཏོ།
en: All the domains of Māra were also disturbed and diminished.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རྩི་ཤིང་དང་། སྨན་དང་། ནགས་ཚལ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ན་བ་དེ་ལོགས་སུ་རབ་ཏུ་འདུད་པར་གྱུར་ཏོ།
en: All the plants, herbs, and forests that there were in the world systems of the great trichiliocosm bowed in the direction of the bodhisattva great being Dharmodgata.

source: །དུས་མ་ཡིན་པའི་མེ་ཏོག་རྣམས་ཀྱང་བྱུང་བར་གྱུར། སྟེང་གི་བར་སྣང་ལས་ཀྱང་མེ་ཏོག་གི་ཆར་རབ་ཏུ་འབབ་པར་གྱུར། རྔའི་སྒྲ་རྣམ་པ་སྣ་ཚོགས་རྣམས་ཀྱང་སྟེང་གི་བར་སྣང་ལས་གྲགས་པར་གྱུར་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ། ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་དང་། ལྷའི་མེ་ཏོག་དང་།
en: Unseasonal flowers also appeared, and from the air above a rain of flowers descended.

source: ཕྱེ་མ་གཞན་དག་གིས་ཀྱང་གཏོར། མངོན་པར་གཏོར།
en: Diverse drumbeats also resounded from the air above.

source: རབ་ཏུ་མངོན་པར་གཏོར་ནས། ཚིག་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་ཡོན་ཏན་གྱིས་དེང་བདག་ཅག་རྣམས་ཀྱིས་ཀྱང་། དོན་དམ་པ་ལས་བྱུང་བའི་གཏམ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཡིད་ཆེས་པར་དཀའ་བ། འཇིག་ཚོགས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མ་ཡིན་པ་བཤད་པ་ཐོས་སོ།
en: The Four Great Kings and Śakra, mighty lord of the gods, also sprinkled, scattered, and showered down divine coral flowers, divine sandalwood powders, divine flowers, and other powders over the bodhisattva great being Dharmodgata, and they said, ‘Noble son, through your enlightened attributes we have now heard a sermon originating from ultimate reality, which is hard for the entire world to have confidence in, an exegesis that cannot be given by bodhisattvas who are settled in [the false views of] perishable composites!’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་འདི་སྐད་སྨྲས་སོ། །ས་ཆེན་པོ་འདི་གཡོས་པར་གྱུར་པའི་རྒྱུ་གང་ཡིན། རྐྱེན་གང་ཡིན། ཆོས་ཀྱིས་འཕགས་པས་སྨྲས་པ།
en: Then the bodhisattva great being Sadāprarudita asked the bodhisattva great being Dharmodgata, ‘What are the causes and what are the conditions that made this great earth quake?’ “ ‘

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱོན་པ་མེད་པ་དང་། བཞུད་པ་མེད་པ་བཤད་པ་འདི་ཁྱོད་ཀྱིས་དྲིས། ངས་བཤད་པ་ན།
en: Noble son,’ replied Dharmodgata, ‘it is because you requested this explanation concerning the noncoming and nongoing of the tathāgatas.

source: སྲོག་ཆགས་བརྒྱད་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར། བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད། སྲོག་ཆགས་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་ནི། རྡུལ་མེད་ཅིང་དྲི་མ་མེད་པར་གྱུར་ནས། ཆོས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པར་གྱུར་པའི་ཕྱིར་རོ།
en: While I was teaching it, a thousand living creatures attained the acceptance that phenomena are nonarising, eight hundred million set their minds on unsurpassed, complete enlightenment, and sixty-four thousand living creatures became stainless and immaculate, and their eye of the doctrine became pure with regard to phenomena.’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དགའ་ཞིང་རབ་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་དང་ལྡན་པར་གྱུར་ཏེ།
en: Then the bodhisattva great being Sadāprarudita was delighted. He was filled with abundant joy, and thought, ‘I have won a boon!

source: བདག་གིས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་བྱོན་པ་དང་། བཞུད་པ་མེད་པའི་ཆོས་བཤད་པ་འདི་ཡོངས་སུ་དྲིས་པ་ལས། སེམས་ཅན་འདི་སྙེད་ཅིག་གི་དོན་བྱས་པ་ནི།
en: As a result of asking for this exegesis of the Dharma concerning the perfection of wisdom, and the noncoming and nongoing of the tathāgatas, I have been of benefit to so many beings.

source: བདག་གིས་རྙེད་པ་རབ་ཏུ་རྙེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་བདག་གི་དགེ་བའི་རྩ་བ་ནི་དེ་ཉིད་ཀྱིས་ཆོག་གི །
en: This root of virtue of mine should in and of itself suffice to ensure that I will attain perfect, unsurpassed, complete enlightenment.

source: ད་ཕྱིན་ཆད་ནི་བདག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་ཐེ་ཚོམ་མི་འབྱུང་།
en: Henceforth there is no doubt that I will attain unsurpassed, complete enlightenment.

source: བདག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བ་ལ་དོགས་པ་མེད་དོ་སྙམ་ནས་དེ་དགའ་ཞིང་རབ་ཏུ་དགའ་བ་དང་།
en: I will undoubtedly become a tathāgata, arhat, completely awakened buddha!’ “

source: ཡིད་བདེ་བ་དེ་ཉིད་དང་ལྡན་པས། ཤིང་ཏ་ལ་བདུན་ཙམ་གྱི་ནམ་མཁའ་ལ་འཕགས་ནས། ཤིང་ཏ་ལ་བདུན་ཙམ་གྱི་ནམ་མཁའ་ལ་གནས་ཏེ། འདི་སྙམ་དུ་བདག་འདི་ལྟར་བར་སྣང་ལ་འདུག་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་ཅིས་མཆོད་སྙམ་དུ་བསམས་པ་དང་།
en: Delighted and joyful, filled with contentment, he ascended into the sky to the height of seven palm trees, and as he remained suspended in the sky at the height of seven palm trees, he thought, ‘How should I, standing in the air in this manner, worship the bodhisattva great being Dharmodgata?’ “

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ནམ་མཁའ་ལ་འཕགས་པ་མཐོང་ནས་དེ་སེམས་ལ་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ཏེ།
en: Then Śakra, mighty lord of the gods, saw the bodhisattva great being Sadāprarudita ascended in the sky, and understood with his own mind the thoughts that he was thinking.

source: ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་དེ་ལ་བྱིན་ནས་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་མེ་ཏོག་འདི་དག་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པ་བྱོས་ཤིག །
en: He presented him with divine coral flowers and said, ‘Noble son, you should worship the sublime bodhisattva great being Dharmodgata with these flowers! {

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་མཐུས་དེང་སེམས་ཅན་སྟོང་ཕྲག་མང་པོ་རྣམས་ཀྱི་དོན་བྱས་པར་གྱུར་པའི་ཕྱིར། རིགས་ཀྱི་བུ་ཁྱོད་ལ་ངེད་ཀྱིས་ཕན་གདགས་སོ།
en: Va.256} Son of enlightened family, since through your power you have today benefited many thousands of beings, we will assist you, noble son!

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟར་སྤྲོ་བར་བྱས་པ་དེ་ལྟ་བུར། གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པར་སྤྲོ་བར་བྱེད་པའི་སེམས་ཅན་དེ་ལྟ་བུ་དག་རབ་ཏུ་དཀོན་ནོ།
en: Noble son, extremely rare are those who would remain enthusiastic for the sake of all beings over immeasurable and countless eons, in the manner in which you have been enthusiastic!’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལས་མེ་ཏོག་མན་དཱ་ར་བ་དག་བླངས་ནས།
en: Then the bodhisattva great being took those coral flowers from Śakra, mighty lord of the gods, and he scattered and showered them over the bodhisattva great being Dharmodgata.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་གཏོར། མངོན་པར་གཏོར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་བདག་གི་ལུས་ཀྱིས་ཀྱང་བཀབ་ནས་ཚིག་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ལ་དེང་ཕན་ཆད་གཡོག་བྱ་བའི་ཕྱིར་བདག་གི་ལུས་ཀྱང་འབུལ་ལོ་ཞེས་ནས།
en: He presented the bodhisattva great being Dharmodgata with his own body and said, ‘Noble son, I offer my body to you, so that it might henceforth be of service.’

source: དེ་བར་སྣང་ལས་བབས་ཏེ་བདག་ཕུལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་མདུན་དུ་ཐལ་མོ་སྦྱར་ཏེ་འདུག་གོ །
en: Thereupon he descended from the sky and presented himself; with his palms together, he stood in front of the bodhisattva great being Dharmodgata. “

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་དང་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ལ་བདག་ཅག་ཀྱང་འདི་ལྟར་ལུས་འབུལ་ལོ།
en: The merchant’s daughter with her five hundred maidens then said to the bodhisattva great being Sadāprarudita, ‘Noble sir, we, too, will offer our bodies to you in this manner.

source: །བདག་ཅག་ཀྱང་དགེ་བའི་རྩ་བ་འདིས་ཆོས་དེ་དག་ཉིད་ཐོབ་པར་གྱུར་ཅིག །
en: Through this root of virtue may we, too, attain these same attributes!
